frontend/controllers/DatakosController.php

SELECT * FROM `tbl_data_kos` WHERE `id`='3'
---
    protected function findModel($id)
    {
        if (($model = Datakos::findOne($id)) !== null) {